{
  "backend/main.mo": "Motoko canister handling contact submissions, rental inquiries, pricing management, and rental cost calculation with timestamp-indexed storage.",
  "feature_evidence.json": "Feature evidence report documenting a Mixpanel snippet update requirement referencing frontend/index.html.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for key frontend components and pages.",
  "frontend/index.css": "Tailwind base and theme variable definitions using OKLCH color values for light and dark modes.",
  "frontend/index.html": "HTML entry point including Google Analytics, Contentsquare, Clarity, Mixpanel initialization, and Smartlook scripts in the head.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes, layout, theming, and toast notifications.",
  "frontend/src/components/Footer.tsx": "Footer with company info, quick links, contact details, and attribution.",
  "frontend/src/components/Header.tsx": "Responsive header with navigation links, branding, and mobile menu using a Sheet component.",
  "frontend/src/hooks/useActor.ts": "React hook creating and managing authenticated/anonymous backend actors with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, including login state, identity loading, and error handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching pricing and performing mutations like rental cost calculation, contact form submission, and rental inquiry submission via the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup with extensive theme variables for light and dark modes, including PS5-themed color tokens.",
  "frontend/src/main.tsx": "Application entry point that initializes React, sets up React Query, and wraps the app with the Internet Identity provider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with sections describing the service’s mission, features, and rental policies using styled cards and PS5-themed gradients.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with validation and backend submission, plus static contact info displayed with UI components.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage with a hero section and rental categories, guiding users to rentals or more info via navigation actions.",
  "frontend/src/pages/RentalsPage.tsx": "React page for selecting rental items, calculating estimated cost, and submitting a rental inquiry via backend hooks with validation and confirmation UI.",
  "frontend/src/utils/contentsquareVerification.ts": "Utility that checks if the Contentsquare tracking script exists and loaded successfully using DOM and Performance API, logging warnings or success.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, custom colors, animations, plugins, and content paths.",
  "project_state.json": "JSON file describing the project's state, architecture notes, analytics requirements, and documented existing features."
}