{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Contentsquare head script installation and verification",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Insert the provided Contentsquare tracking script into the global HTML <head> so it loads on all routes.",
      "acceptanceCriteria": [
        "frontend/index.html contains <script src=\"https://t.contentsquare.net/uxa/f6cd018ba08fc.js\"></script> inside the <head> section.",
        "The script is present in the final rendered page source when visiting the site in a browser."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Add <script src=\"https://t.contentsquare.net/uxa/f6cd018ba08fc.js\"></script> inside the <head> so it applies to all routes, ensuring the existing Google Analytics scripts remain unchanged and in place."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a lightweight, non-breaking verification check that logs English success/failure messages to the browser console based on whether the Contentsquare script resource loads.",
      "acceptanceCriteria": [
        "When the Contentsquare script loads successfully, the browser console shows an English confirmation message (e.g., \"Contentsquare tracking script loaded\").",
        "If the Contentsquare script fails to load (e.g., blocked), the browser console shows an English warning message (e.g., \"Contentsquare tracking script failed to load\") and the app continues functioning normally."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/contentsquareVerification.ts",
          "operation": "create",
          "description": "Create a small verification utility that checks for the Contentsquare script tag and/or loaded resource (e.g., via Performance Resource Timing) and logs clear English success/failure messages to the browser console without throwing if unavailable/blocked."
        },
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Import and run the Contentsquare verification utility during app startup (or after window load) so success/failure is reported to the console while ensuring failures are caught/handled and do not interrupt React rendering."
        }
      ]
    }
  ]
}