{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 15,
  "summary": "PS5 Rentals is a frontend-only static multi-page website (no React and no backend) for browsing PS5 rental offerings (console, games, controllers), viewing daily pricing, calculating total rental cost client-side, and allowing users to contact manually. The site consists of separate HTML pages (Home, About, Contact, Rentals) linked with shared navigation, a shared CSS file, and a shared JavaScript file for the rental cost calculator. Google Analytics is installed on every page using the provided gtag.js tag (G-YR9GR62G68).",
  "architectural_notes": [
    "Project scope changed to frontend-only: separate static HTML pages (Home, About, Contact, Rentals) with shared navigation; no React SPA and no backend canister.",
    "Rental total cost is calculated entirely client-side in JavaScript based on selected item type, quantity, and rental duration; user confirms by contacting manually (no payments, no backend submission).",
    "Google Analytics is included on every page via the provided gtag.js snippet (Measurement ID: G-YR9GR62G68) placed immediately after the <head> element, with only one tag per page.",
    "Microsoft Clarity is added as an additional analytics script: include the provided Clarity snippet in the <head> of every page (one instance per page).",
    "Mixpanel analytics should be added to the <head> of every static HTML page (placed right before </head>) using the provided snippet; project token must be configured.",
    "Smartlook analytics/recording script should be added in the <head> of every static HTML page using the provided snippet (init token f647c2f391c5a02c88d908affc6d04eda2adbc20, region: 'eu'), with one instance per page.",
    "Mixpanel snippet/project token has been provided and should be configured as: mixpanel.init('da58e366649ab3a9c5b1fc49681f9d76', { autocapture: true, record_sessions_percent: 100 }) on every static HTML page (right before </head>)."
  ],
  "known_issues": [],
  "isFixRequest": false,
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Single-page app routing with shared layout",
      "synonyms": [
        "TanStack Router navigation",
        "SPA pages"
      ],
      "description": "Defines a root layout with persistent Header and Footer and routes for Home, About, Contact, and Rentals pages using @tanstack/react-router.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Responsive header navigation with mobile drawer",
      "synonyms": [
        "Navbar",
        "Mobile menu sheet"
      ],
      "description": "Implements a sticky header with brand/logo, desktop navigation links, and a mobile slide-over Sheet menu, including a primary \"Rent Now\" CTA.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Home page marketing sections",
      "synonyms": [
        "Landing page",
        "Hero + categories"
      ],
      "description": "Shows a hero section, three category cards (consoles, games, controllers) with images/icons, and CTAs navigating users to the Rentals page.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "About page content and rental policies",
      "synonyms": [
        "Company mission page"
      ],
      "description": "Displays mission statement, feature/value cards (quality, flexible rentals, affordability, support), rental policy details, and service area information.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Contact page with backend form submission",
      "synonyms": [
        "Contact form",
        "Support message submission"
      ],
      "description": "Provides a contact form (name/email/message) with required-field validation, loading state, toast notifications, and submission to the backend canister via React Query mutation.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Rentals page with pricing display and inquiry submission",
      "synonyms": [
        "Rental request form",
        "Equipment catalog"
      ],
      "description": "Displays available equipment categories with daily rates (fetched from backend pricing), provides a rental inquiry form (item type, quantity, start date, duration), validates input, shows an estimated cost, submits inquiry to backend, and presents a confirmation state with the returned total cost.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "React Query hooks for canister operations",
      "synonyms": [
        "Backend query/mutation hooks"
      ],
      "description": "Implements reusable hooks to fetch pricing, calculate rental cost, submit contact form, and submit rental inquiry; mutations invalidate relevant cached query keys.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Actor lifecycle management tied to Internet Identity",
      "synonyms": [
        "Actor hook",
        "Authenticated/anonymous actor"
      ],
      "description": "Creates and caches a canister actor via React Query; uses authenticated identity when available, otherwise creates an anonymous actor; invalidates/refetches dependent queries when the actor changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Internet Identity authentication provider",
      "synonyms": [
        "II login",
        "AuthClient wrapper"
      ],
      "description": "Provides a React context for Internet Identity auth with login/logout, persistent identity loading on mount, delegation validity checks, configurable AuthClient options, and status flags for UI consumption.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Motoko backend for pricing and submissions",
      "synonyms": [
        "IC canister backend",
        "Rental logic canister"
      ],
      "description": "Motoko actor defines item types and pricing, calculates rental cost, accepts contact submissions and rental inquiries (storing them by timestamp), returns current pricing, supports pricing updates, and exposes queries to list stored submissions/inquiries (inquiries sorted by timestamp).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Theming and styling system (Tailwind + OKLCH + dark mode)",
      "synonyms": [
        "Design system",
        "PS5 brand theme"
      ],
      "description": "Uses Tailwind CSS with CSS variables in OKLCH, extended theme tokens (including ps5-blue/ps5-purple), dark mode via class, and next-themes ThemeProvider for theme management.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Google Analytics instrumentation",
      "synonyms": [
        "gtag integration"
      ],
      "description": "Includes Google Analytics tracking script (gtag.js) in the HTML entrypoint to track SPA usage.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-add-the-provided-microsoft-clarity-tracking-snippet-to-the-html-head-so-it-loads-for-the-entire-app-all-spa-routes-use-the-exact-script-content-and-tag-id-vc3rnks6lt-as-supplied-by-the-user",
      "title": "Add the provided Microsoft Clarity tracking snippet to the HTML <head> so it loads for the entire app (all SPA routes). Use the exact script content and tag ID \"vc3rnks6lt\" as supplied by the user.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-add-the-provided-mixpanel-tracking-snippet-to-the-global-html-entrypoint-so-it-loads-for-the-entire-app-on-all-spa-routes-by-placing-it-right-before-the-closing-head-tag-in-frontend-index-html-use-the-exact-script-content-provided-by-the-user-including-the-placeholder-project-token-string-your-project-token-and-the-mixpanel-init-options-autocapture-true-record-sessions-percent-100",
      "title": "Add the provided Mixpanel tracking snippet to the global HTML entrypoint so it loads for the entire app on all SPA routes by placing it right before the closing </head> tag in frontend/index.html. Use the exact script content provided by the user, including the placeholder project token string 'YOUR_PROJECT_TOKEN' and the Mixpanel init options (autocapture: true, record_sessions_percent: 100).",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-add-the-provided-smartlook-tracking-snippet-to-the-global-website-header-by-inserting-it-inside-the-head-section-of-frontend-index-html-using-the-exact-script-contents-provided-by-the-user-including-init-token-f647c2f391c5a02c88d908affc6d04eda2adbc20-and-region-eu",
      "title": "Add the provided Smartlook tracking snippet to the global website header by inserting it inside the <head> section of frontend/index.html, using the exact script contents provided by the user (including init token \"f647c2f391c5a02c88d908affc6d04eda2adbc20\" and { region: 'eu' }).",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "feature-update-the-mixpanel-tracking-snippet-in-frontend-index-html-to-use-the-exact-script-content-provided-by-the-user-including-calling-mixpanel-init-da58e366649ab3a9c5b1fc49681f9d76-autocapture-true-record-sessions-percent-100-and-keeping-the-snippet-placed-inside-the-head-right-before-the-closing-head-tag",
      "title": "Update the Mixpanel tracking snippet in frontend/index.html to use the exact script content provided by the user, including calling mixpanel.init('da58e366649ab3a9c5b1fc49681f9d76', { autocapture: true, record_sessions_percent: 100, }) and keeping the snippet placed inside the <head> (right before the closing </head> tag).",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Add Microsoft Clarity tracking script (tag vc3rnks6lt) into the <head> of every static HTML page",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Rebuild and redeploy the application so it is available again after the draft expiration, including the new Microsoft Clarity <head> script.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Add Mixpanel tracking snippet (init with project token, autocapture/session recording settings) right before closing </head> on every static HTML page",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Add Smartlook tracking snippet (init token f647c2f391c5a02c88d908affc6d04eda2adbc20, region eu) into the <head> of every static HTML page",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "gameProjectType": "none",
  "projectName": "PS5 Rentals",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}